{
  "full_name": "Кандидат",
  "email": null,
  "phone": null,
  "links": [],
  "location": [
    "Алматы, м. Москва"
  ],
  "summary": "Активно ищет работу в области Data Engineering и BI-аналитики.",
  "total_experience_months": 68,
  "work_history": [
    {
      "role": "Data Engineer",
      "company": "TAS CREDIT ONLINE",
      "start_date": "2025-05",
      "end_date": "Present",
      "description": "Поднял с нуля сервис-проект по анализу банковских выписок и парсингу отчета из ПКБ",
      "technologies": []
    },
    {
      "role": "BI-аналитик",
      "company": "СК Jusan Garant",
      "start_date": "2024-12",
      "end_date": "2025-12",
      "description": "Автоматизация процессов Финансового департамента: - Выгрузка из 1С - ETL - Обработка и чистка данных - Оптимизация SQL - Визуализация в Power BI - Data-mining с помощью Python (pandas, sqlalchemy)",
      "technologies": [
        "1С",
        "ETL",
        "SQL",
        "Power BI",
        "Python",
        "pandas",
        "sqlalchemy"
      ]
    },
    {
      "role": "QA-аналитик",
      "company": "Kaspi Bank, АО",
      "start_date": "2024-06",
      "end_date": "2024-09",
      "description": "- Мониторинг событии в мобильном приложении - Составление анализа и воронок поведения пользователя - Написание ТЗ для разрабов - Коммуникация с UX, продактами, тестерами - Работа в DWH, ClickHouse, StarRocks и Amplitude - Успешный запуск онлайн-продуктов в банке - Постоянное улучшение системы и продуктов",
      "technologies": [
        "DWH",
        "ClickHouse",
        "StarRocks",
        "Amplitude"
      ]
    },
    {
      "role": "Product Manager",
      "company": "Dauscher",
      "start_date": "2023-06",
      "end_date": "2024-05",
      "description": "• Разработка стратегии продвижения вверенных продуктов компании в Казахстане; • Маркетинговый анализ целевого рынка и результатов деятельности компании, а также факторов, влияющих на рост доли рынка вверенных продуктов в РК; • Долгосрочный и краткосрочный прогноз продаж и рыночной доли продуктов компании в стране; • Годовое Бренд-планирование, разработка и контроль бюджета A&P; • Участие в ценообразовании; • Разработка стратегии развития отдела внешней службы, трейда и дистрибьюции; • Переговоры B2B с Китай и Турция • Диджитал стратегия продвижения продукции; • Бюджетирование затрат, работа с контрагентами; • Аналитика результатов, формирование отчетности.",
      "technologies": []
    },
    {
      "role": "BI-аналитик",
      "company": "Seyco Group",
      "start_date": "2022-01",
      "end_date": "2023-06",
      "description": "Создание и администрирование отчетов в Power BI. Автоматизация и цифровизация внутренних процессов на Low-Code платформах таких как Appsheet, Power Automate и др. Администрирование Windows серверов и Cisco модемов. Анализ и структурирование баз данных на MS SQL.",
      "technologies": [
        "Power BI",
        "Appsheet",
        "Power Automate",
        "Windows",
        "Cisco",
        "MS SQL"
      ]
    },
    {
      "role": "Ассистент коммерческого отдела",
      "company": "Evrika",
      "start_date": "2021-06",
      "end_date": "2021-12",
      "description": "Вносить данные поставщиков в базу поставщиков; Проверять документы поставщиков (договоры, лицензии, сертификаты); Контролировать договора по вверенной категории с целью предупреждение нарушений договорных обязательств, истечения сроков т.д.; Осуществлять своевременное и точное размещение заказов на портале поставщика (рассылка заказа); Осуществлять корректировку/сверку заказов с поставщиками; Осуществлять формирование заказов по заданию менеджера; Формирование заказа в системе 1С; Вносить поставляемый товар в систему 1C; Осуществлять формирование прайс-листов; Вносить корректировки в ассортиментную матрицу; Проводить переоценку товара; Вести техническую работу с поставщиками: закрытие поставок, запрос/предоставление номенклатурных документов, внесение/закрытие установленных данных в базу поставщика по проведенным акциям; Принимать участие в запуске акций в магазине и осуществлять их техническое закрытие по истечению; Формировать отчеты по запросу категорийного директора;",
      "technologies": [
        "1С"
      ]
    },
    {
      "role": "Системный администратор",
      "company": "Ассоциация КазРЕНА",
      "start_date": "2020-05",
      "end_date": "2021-06",
      "description": "Установка и обслуживание компьютерной и офисной техники, оргтехники, внутренней АТС. Обеспечение безошибочной работы системного программного обеспечения (ОС Windows, Linux). Обеспечение работоспособности и безопасности сети компании. Установка, настройка и обновление офисного и прикладного ПО (MS Office, 1С и т.п.). Обеспечение резервного копирования данных (а также восстановление данных при необходимости). Техническая поддержка и помощь пользователей. Составление отчетов о проделанной работе.",
      "technologies": [
        "Windows",
        "Linux",
        "MS Office",
        "1С"
      ]
    }
  ],
  "education": [
    {
      "institution": "Международный университет информационных технологий, Алматы",
      "degree": "Информационные технологии, Информационные системы",
      "year": "2022"
    },
    {
      "institution": "Специализированный лицей-интернат «Білім-Инновация» города Алматы",
      "degree": "",
      "year": "2018"
    }
  ],
  "skills": [
    "MS Excel",
    "PostgreSQL",
    "Data studio",
    "MS SQL Server",
    "Java",
    "Python",
    "C++",
    "Cisco",
    "Администрирование серверов Linux",
    "Power BI",
    "Google Sheets",
    "1С",
    "CRM",
    "BigQuery",
    "SQL",
    "Atlassian Jira",
    "SQLite",
    "Работа с данными – аналитика, обработка, расчет, управление базой данных",
    "Работа с реляционными базами данных",
    "Power automate",
    "RPA",
    "MS SQL",
    "DAX",
    "Базы данных",
    "SQL Server",
    "A/B тестирование",
    "ООП",
    "Аналитическое мышление"
  ],
  "languages": [
    "Казахский — Родной",
    "Английский — B2 — Средне-продвинутый",
    "Русский — C1 — Продвинутый",
    "Турецкий — B1 — Средний"
  ]
}