{
  "full_name": "Кандидат",
  "email": null,
  "phone": null,
  "links": [],
  "location": [
    "Алматы"
  ],
  "summary": "Высококвалифицированный специалист, привык работать в высоком темпе параллельно обучаясь новым знаниям, всегда мотивирован создавать качественный продукт. Придерживаюсь структурированной и плодотворной работы а так же взаимодействия с командой на всех этапах разработки. В свободное время люблю активный отдых. Из интересов игра на гитаре.",
  "total_experience_months": 66,
  "work_history": [
    {
      "role": "Frontend-разработчик",
      "company": "Halyk Finservice",
      "start_date": "2022-10",
      "end_date": "Present",
      "description": "Разработка ПО - web приложений, Поддержка всего функционала Epay, Проектирование/разработка нового и оптимизация/рефакторинг работы имеющегося функционала, Внутренняя система управления, Участие в командных мероприятиях по сбору требований, технической экспертизы по реализации новых возможностей, Аудит архитектурных решений",
      "technologies": [
        "CSS",
        "Frontend",
        "React.js",
        "JavaScript",
        "VueJS",
        "Sass",
        "Gitlab",
        "TypeScript",
        "Git",
        "Node.js",
        "ES6",
        "CSS3",
        "HTML5",
        "Redux",
        "MobX",
        "ReactJS"
      ]
    },
    {
      "role": "Frontend-разработчик",
      "company": "ASTER AUTO",
      "start_date": "2021-10",
      "end_date": "2022-10",
      "description": "Участие в проектировании Web-сайтов; web-приложений и сервисов, Верстка сайтов, шаблонов, e-mail рассылок, промо-страниц, Разработка интерактивных элементов на основе дизайн-макетов, Привязка к пользовательскому интерфейсу скриптов, Оптимизация и расширение функционала имеющегося кода, Обеспечение необходимого уровня пользовательского интерфейса и опыта взаимодействия, Отладка, написание модульных и интеграционных тестов, Аудит архитектурных решений",
      "technologies": []
    },
    {
      "role": "Frontend-разработчик",
      "company": "It-dass solutions",
      "start_date": "2020-09",
      "end_date": "2021-09",
      "description": "Разработка Frontend-части проектов, Разработка Backend-части проектов, Web интеграции, Работа с API, Вёрстка сайта с нуля на WordPress и cms bitrix, разработка API и интеграция с crm bitrix24, Устранение багов, Взаимодействие с другими участниками команды",
      "technologies": []
    }
  ],
  "education": [
    {
      "institution": "江苏理工学院",
      "degree": "Бакалавр в области разработки программного обеспечения",
      "year": "2020"
    }
  ],
  "skills": [
    "CSS",
    "Frontend",
    "React.js",
    "JavaScript",
    "VueJS",
    "Sass",
    "Gitlab",
    "TypeScript",
    "Git",
    "Node.js",
    "ES6",
    "CSS3",
    "HTML5",
    "Redux",
    "MobX",
    "ReactJS",
    "Next.js"
  ],
  "languages": [
    "Казахский — Родной",
    "Английский — B1 — Средний",
    "Китайский — B2 — Средне-продвинутый",
    "Русский — C2 — В совершенстве"
  ]
}