{
  "full_name": "Кандидат",
  "email": null,
  "phone": null,
  "links": [],
  "location": [
    "Алматы"
  ],
  "summary": "Дисциплинирован, привык работать на результат. Занимаюсь спортом, что помогает поддерживать концентрацию и выносливость. Быстро обучаюсь новым инструментам и технологиям. Внимателен к деталям, умею находить неточности и ошибки.",
  "total_experience_months": 17,
  "work_history": [
    {
      "role": "Manual QA Engineer",
      "company": "ItsTelegram",
      "start_date": "2024-10",
      "end_date": "Present",
      "description": "Тестирование веб-приложений (UI + API): проверка функционала, валидаций, бизнес-логики, ошибок отображения. Тестирование API: работа в Postman, создание коллекций, параметризация запросов, проверка статусов, заголовков, body, авторизации (Bearer, API-key). Тестирование кэширования (браузерный кэш, обновление ресурсов, поведение при stale данных). Базовые SQL-запросы: SELECT, JOIN, фильтрация данных, проверка корректности сохранения данных в базе. Тестовая документация: составление чек-листов, тест-кейсов, тест-планов, позитивных/негативных сценариев. Регрессионное тестирование, Smoke, Sanity. Работа с баг-трекингом: создание баг-репортов в Jira, проверка фиксов, контроль статусов задач. Работа с DevTools (логирование, сеть, LocalStorage/Cookies). Понимание клиент-серверной архитектуры, HTTP, REST. Основы Git (clone, commit, branch, push).",
      "technologies": [
        "Postman",
        "SQL",
        "Jira",
        "DevTools",
        "Git"
      ]
    }
  ],
  "education": [
    {
      "institution": "Карагандинский Экономический Университет Казпотребсоюза",
      "degree": "Бизнес и право, Юриспруденция",
      "year": "2016"
    }
  ],
  "skills": [
    "тестирование веб приложений",
    "Тестирование API",
    "Анализ тестирования",
    "Agile",
    "Регрессионное тестирование",
    "Основы тестирования (виды, уровни, жизненный цикл бага)",
    "Базовые знания методологий разработки ПО (Waterfall, Agile/Scrum)",
    "Опыт работы с Chrome DevTools (проверка верстки, консоль, сеть)",
    "тестирование мобильных приложений",
    "Postman",
    "Нагрузочное тестирование"
  ],
  "languages": [
    "Русский — Родной",
    "Английский — B1 — Средний"
  ]
}