{
  "full_name": "Кандидат",
  "email": null,
  "phone": null,
  "links": [],
  "location": [
    "Алматы"
  ],
  "summary": "Легко обучаема, любознательна и коммуникабельна. Ответственно отношусь к работе и её результатам. Как сильные стороны, хотелось бы отметить скрупулезность и внимательность, способность к конструктивному взаимодействию с разработчиками, способность легко устанавливать контакт и выстраивать отношения с людьми, хорошо развитое логическое мышление и умение быстро ориентироваться в сложных ситуациях.",
  "total_experience_months": 121,
  "work_history": [
    {
      "role": "QA Engineer",
      "company": "ТОО «Smart Parking Technologies»",
      "start_date": "2022-05",
      "end_date": "Present",
      "description": "Написание автотестов (Robot Framework, базируется на Python); Автоматизация сайта parqour.app; Умение читать логи; Составление и ведение тестовых сценариев, баг-репортов, чек-листов, тест-кейсов; Постановка задач backend и frontend разработчикам; Аналитика новой доработки, постановка задач по новой доработке; Ручное тестирование веб и мобильного приложения;",
      "technologies": [
        "Robot Framework",
        "Python"
      ]
    },
    {
      "role": "QA Engineer",
      "company": "TOO \"Worktap.kz\"",
      "start_date": "2021-12",
      "end_date": "Present",
      "description": "Ручное тестирование веб-сайта; Составление и ведение баг-репортов; Постановка задач разработчикам; Аналитика новой доработки, постановка задач по новой доработке; Предложения по функциональности сайта глазами клиента; Работа с системами баг-трекинга (Jira, Trello и т.п.);",
      "technologies": [
        "Jira",
        "Trello"
      ]
    },
    {
      "role": "QA Engineer",
      "company": "AO \"Сбербанк Казахстан\"",
      "start_date": "2022-02",
      "end_date": "2022-05",
      "description": "Составление и ведение тестовых сценариев, баг-репортов, чек-листов; Составление тест-кейсов на предстоящие релизы; Постановка задач backend и frontend разработчикам; Аналитика новой доработки, постановка задач по новой доработке; Ручное тестирование мобильных приложений; Умение читать логи; Работа с системами баг-трекинга (Jira, Trello и т.п.); Тестирование мобильного приложения в проектах \"Платежи и Переводы\"; Изучение автотестов.",
      "technologies": [
        "Jira",
        "Trello"
      ]
    },
    {
      "role": "Junior QA Engineer",
      "company": "TOO \"TREDO\"",
      "start_date": "2021-08",
      "end_date": "2022-02",
      "description": "Введение бэклога; Тестирование входящей ошибки от бизнеса; Коммуникация с бизнес-клиентами, разработчиками по входящим/приходящим ошибкам; Постановка задачи разработчикам; Составление тест-кейсов; Аналитика новой доработки, постановка задач по новой доработке; Ручное тестирование мобильных приложений; Тестирование мобильного приложения банковских продуктов; Изучение логов.",
      "technologies": []
    },
    {
      "role": "IT-рекрутер/ HR-manager",
      "company": "TOO \"TREDO\"",
      "start_date": "2020-07",
      "end_date": "2021-09",
      "description": "Рекрутинг в сфере ИТ (поиск, привлечение, отбор и подбор персонала); Организация действий и мероприятий по введению новых сотрудников в должность, помощь в быстрой адаптации для новичков; Ведение кадрового делопроизводства (составление всех документов компании с начала основания, составление графика отпусков сотрудников, личные дела сотрудников и т.п.); Развитие корпоративной культуры в компании, составление индивидуальных тимбилдингов, подходящих под специфику компании, проведение мероприятий с целью укрепления коллектива; Составление корпоративного годового плана компании.",
      "technologies": []
    },
    {
      "role": "HR-специалист",
      "company": "TOO \"Terminal Logistics Services\"",
      "start_date": "2019-11",
      "end_date": "2020-03",
      "description": "Рекрутинг (поиск, привлечение, отбор и подбор персонала); Организация действий и мероприятий по введению новых сотрудников в должность, помощь в быстрой адаптации для новичков; Ведение полного кадрового делопроизводства (работа в программе 1С, составление графика отпусков сотрудников); Развитие корпоративной культуры в компании, проведение мероприятий с целью укрепления коллектива; Составление корпоративного годового плана компании.",
      "technologies": []
    },
    {
      "role": "Специалист по контролю качества контента/модератор",
      "company": "TOO \"Appetite\"",
      "start_date": "2018-06",
      "end_date": "2019-08",
      "description": "Отслеживание и проверка пользовательского контента; Редактирование текстов и корректировка отображений веб-страниц; Редактирование и обработка графических файлов под требуемые форматы.",
      "technologies": []
    },
    {
      "role": "SMM-менеджер",
      "company": "TOO \"Appetite\"",
      "start_date": "2018-06",
      "end_date": "2019-08",
      "description": "Ведение социальных сетей компании (instagram, facebook); Создание и размещение контента: написания статей, постов приложения, поиск картинок; Поиск и привлечение интересных людей со всего Казахстана для тестирования приложения.",
      "technologies": []
    },
    {
      "role": "Руководитель Центра карьеры и лидерства",
      "company": "Университет \"Туран\"",
      "start_date": "2017-09",
      "end_date": "2018-06",
      "description": "Осуществление контроля за трудоустройством выпускников Университета, поддержание базы по выпускникам Университета, работа с Ассоциацией выпускников \"Туран-Зерде\"; Проведение мастер-классов, ярмарок вакансий и других мероприятий с целью трудоустройства выпускников и студентов университета; SMM - продвижение центра в соц. сетях; Прямая работа с работодателями.",
      "technologies": []
    },
    {
      "role": "Главный специалист Центра планирования карьеры и работы с выпускниками",
      "company": "УО \"Almaty Management University\"",
      "start_date": "2015-09",
      "end_date": "2017-11",
      "description": "Работа с выпускниками университета - ежемесячные встречи, тематические мероприятия, поиск места работы для обратившихся выпускников; Проведение мастер-классов и приглашение спикеров для студентов и выпускников; Прямая работа с работодателями.",
      "technologies": []
    }
  ],
  "education": [
    {
      "institution": "Университет «Туран\"",
      "degree": "Маркетинг",
      "year": "2017"
    },
    {
      "institution": "Almaty Management University",
      "degree": "ресторанное дело и гостиничный бизнес",
      "year": "2015"
    }
  ],
  "skills": [
    "Организаторские навыки",
    "Работа в команде",
    "Грамотность",
    "Планирование",
    "Jira",
    "Test case",
    "Функциональное тестирование",
    "Тестирование пользовательского интерфейса",
    "Robot framework"
  ],
  "languages": [
    "Казахский — Родной"
  ]
}